# задаёт базовый (родительский) образ. сдесь именую его как builder
# чтобы потом взять из него все что нужно и не использовать так как он много весит
# Делаю много этапную сборку
FROM golang:1.22-alpine as builder

# задаёт рабочую директорию для следующей инструкции
WORKDIR /app

# копирует в контейнер файлы и папки. Копируем файлы со списками зависимостей
COPY go.mod go.sum* ./

# выполняет команду и создаёт слой образа. Используется для установки в контейнер пакетов.
# Скачиваем все внешние библиотеки (go-модули)
RUN go mod download

# копируем весь исходный код проекта в контейнер
COPY . .

# компилируем бинарник
RUN CGO_ENABLED=0 GOOS=linux go build -lao server .

# минимизируем образ ↓
##############################################################################

# берем Alpine Linux
FROM alpine:latest

# устанавливаем часовой пояс и корневые сертификаты(для HTTPS запросов)
RUN apk --no-cache add ca-certificates tzdata

# создаем рабочую папку
WORKDIR /root/

# копируем скомпилированный файл из первого этапа
COPY --from=builder /app/server .

# указывает на необходимость открыть порт. Объявляем порт, который слушает приложение
EXPOSE 8080

# описывает команду с аргументами, которую нужно выполнить когда контейнер будет запущен. 
# Аргументы могут быть переопределены при запуске контейнера. В файле может присутствовать лишь одна инструкция
# В одном файле Dockerfile может присутствовать лишь одна инструкция CMD. Если в файле есть несколько таких инструкций, 
# система проигнорирует все кроме последней.
# Инструкция CMD может иметь exec-форму. Если в эту инструкцию не входит упоминание исполняемого файла, тогда в файле 
# должна присутствовать инструкция ENTRYPOINT. В таком случае обе эти инструкции должны быть представлены в формате JSON.
# Аргументы командной строки, передаваемые docker run, переопределяют аргументы, предоставленные инструкции CMD в Dockerfile.
CMD ["./server"]